000100* hello.cob
000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. HELLO.
000400 PROCEDURE DIVISION.
000500* your code should output "Hello, world!"
000600 
000700* it should _probably_ be a one-liner ;)
000800     STOP RUN.
